import { ChangeDetectionStrategy, Component, Input } from '@angular/core';

export interface ArticleItem {
  imgUrl: string;
  publishDate: Date;
  title: string;
  desc: string;
  href: string;
}

@Component({
  selector: 'app-articles-page',
  templateUrl: './articles-page.component.html',
  changeDetection: ChangeDetectionStrategy.OnPush,
  styleUrls: ['./articles-page.component.scss']
})
export class ArticlesPageComponent {
  @Input() articles: ArticleItem[];

  constructor() {
    this.articles = [
      {
        imgUrl: 'https://img.mako.co.il/2019/03/24/WI0324_i.jpg',
        publishDate: new Date(2019, 2, 28),
        title: 'המיזם שמזמין אתכם לארח אח שכול: "פתחו את ביתכם ושמעו את סיפורים"',
        desc: `במיזם שיצרו האחים השכולים הם מאפשרים לציבור הרחב להזמין אותם לבתים, למרכזים קהילתיים ותנועות נוער כדי לשתף
        בסיפור החיים של האחים שאיבדו, הצחוקים, החלומות והחיים שלהם עם השכול. "המפגשים מפילים חומות ומקרבים, בואו לשמוע
        אותנו"`,
        href: 'http://google.com'
      },
      {
        imgUrl: 'https://img.mako.co.il/2019/03/24/WI0324_i.jpg',
        publishDate: new Date(2019, 3, 12),
        title: 'המיזם שמזמין אתכם לארח אח שכול: "פתחו את ביתכם ושמעו את סיפורים"',
        desc: `במיזם שיצרו האחים השכולים הם מאפשרים לציבור הרחב להזמין אותם לבתים, למרכזים קהילתיים ותנועות נוער כדי לשתף
        בסיפור החיים של האחים שאיבדו, הצחוקים, החלומות והחיים שלהם עם השכול. "המפגשים מפילים חומות ומקרבים, בואו לשמוע
        אותנו"`,
        href: 'http://google.com'
      },
      {
        imgUrl: 'https://img.mako.co.il/2019/03/24/WI0324_i.jpg',
        publishDate: new Date(2019, 4, 15),
        title: 'המיזם שמזמין אתכם לארח אח שכול: "פתחו את ביתכם ושמעו את סיפורים"',
        desc: `במיזם שיצרו האחים השכולים הם מאפשרים לציבור הרחב להזמין אותם לבתים, למרכזים קהילתיים ותנועות נוער כדי לשתף
        בסיפור החיים של האחים שאיבדו, הצחוקים, החלומות והחיים שלהם עם השכול. "המפגשים מפילים חומות ומקרבים, בואו לשמוע
        אותנו"`,
        href: 'http://google.com'
      },
      {
        imgUrl: 'https://img.mako.co.il/2019/03/24/WI0324_i.jpg',
        publishDate: new Date(2020, 0, 1),
        title: 'המיזם שמזמין אתכם לארח אח שכול: "פתחו את ביתכם ושמעו את סיפורים"',
        desc: `במיזם שיצרו האחים השכולים הם מאפשרים לציבור הרחב להזמין אותם לבתים, למרכזים קהילתיים ותנועות נוער כדי לשתף
        בסיפור החיים של האחים שאיבדו, הצחוקים, החלומות והחיים שלהם עם השכול. "המפגשים מפילים חומות ומקרבים, בואו לשמוע
        אותנו"`,
        href: 'http://google.com'
      },
      {
        imgUrl: 'https://img.mako.co.il/2019/03/24/WI0324_i.jpg',
        publishDate: new Date(2020, 5, 18),
        title: 'המיזם שמזמין אתכם לארח אח שכול: "פתחו את ביתכם ושמעו את סיפורים"',
        desc: `במיזם שיצרו האחים השכולים הם מאפשרים לציבור הרחב להזמין אותם לבתים, למרכזים קהילתיים ותנועות נוער כדי לשתף
        בסיפור החיים של האחים שאיבדו, הצחוקים, החלומות והחיים שלהם עם השכול. "המפגשים מפילים חומות ומקרבים, בואו לשמוע
        אותנו"`,
        href: 'http://google.com'
      },
      {
        imgUrl: 'https://img.mako.co.il/2019/03/24/WI0324_i.jpg',
        publishDate: new Date(2020, 5, 18),
        title: 'המיזם שמזמין אתכם לארח אח שכול: "פתחו את ביתכם ושמעו את סיפורים"',
        desc: `במיזם שיצרו האחים השכולים הם מאפשרים לציבור הרחב להזמין אותם לבתים, למרכזים קהילתיים ותנועות נוער כדי לשתף
        בסיפור החיים של האחים שאיבדו, הצחוקים, החלומות והחיים שלהם עם השכול. "המפגשים מפילים חומות ומקרבים, בואו לשמוע
        אותנו"`,
        href: 'http://google.com'
      },
      {
        imgUrl: 'https://img.mako.co.il/2019/03/24/WI0324_i.jpg',
        publishDate: new Date(2020, 2, 28),
        title: 'המיזם שמזמין אתכם לארח אח שכול: "פתחו את ביתכם ושמעו את סיפורים"',
        desc: `במיזם שיצרו האחים השכולים הם מאפשרים לציבור הרחב להזמין אותם לבתים, למרכזים קהילתיים ותנועות נוער כדי לשתף
        בסיפור החיים של האחים שאיבדו, הצחוקים, החלומות והחיים שלהם עם השכול. "המפגשים מפילים חומות ומקרבים, בואו לשמוע
        אותנו"`,
        href: 'http://google.com'
      },
      {
        imgUrl: 'https://img.mako.co.il/2019/03/24/WI0324_i.jpg',
        publishDate: new Date(2021, 5, 12),
        title: 'המיזם שמזמין אתכם לארח אח שכול: "פתחו את ביתכם ושמעו את סיפורים"',
        desc: `במיזם שיצרו האחים השכולים הם מאפשרים לציבור הרחב להזמין אותם לבתים, למרכזים קהילתיים ותנועות נוער כדי לשתף
        בסיפור החיים של האחים שאיבדו, הצחוקים, החלומות והחיים שלהם עם השכול. "המפגשים מפילים חומות ומקרבים, בואו לשמוע
        אותנו"`,
        href: 'http://google.com'
      }
    ];
  }
}
